docs.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Async Http Client - Clojure - Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-07-14 15:45:59 CEST"/>
<meta name="author" content="Hubert Iwaniuk"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Async Http Client - Clojure - Documentation</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 User Documentation [3/3] </a>
<ul>
<li><a href="#sec-1.1">1.1 HTTP methods</a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 GET </a></li>
<li><a href="#sec-1.1.2">1.1.2 POST/PUT </a>
<ul>
<li><a href="#sec-1.1.2.1">1.1.2.1 Submitting body as String </a></li>
<li><a href="#sec-1.1.2.2">1.1.2.2 Submitting form parameters </a></li>
<li><a href="#sec-1.1.2.3">1.1.2.3 Submitting body as InputStream </a></li>
</ul>
</li>
<li><a href="#sec-1.1.3">1.1.3 DELETE </a></li>
<li><a href="#sec-1.1.4">1.1.4 HEAD </a></li>
<li><a href="#sec-1.1.5">1.1.5 OPTIONS </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 Requesting</a>
<ul>
<li><a href="#sec-1.2.1">1.2.1 Preparing request </a></li>
<li><a href="#sec-1.2.2">1.2.2 Executing request </a>
<ul>
<li><a href="#sec-1.2.2.1">1.2.2.1 Status line </a></li>
<li><a href="#sec-1.2.2.2">1.2.2.2 Headers </a></li>
<li><a href="#sec-1.2.2.3">1.2.2.3 Body part </a></li>
<li><a href="#sec-1.2.2.4">1.2.2.4 Body completed </a></li>
<li><a href="#sec-1.2.2.5">1.2.2.5 Error </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-1.3">1.3 Streaming</a></li>
</ul>
</li>
<li><a href="#sec-2">2 Developer [0/1] </a>
<ul>
<li><a href="#sec-2.1">2.1 Building</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> User Documentation [3/3] </h2>
<div class="outline-text-2" id="text-1">

<p>For now there is not much of documentation here.
I've tried to cover ahc-clj with tests, this is a good source of examples.
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> <span class="done DONE"> DONE</span> HTTP methods &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> GET </h4>
<div class="outline-text-4" id="text-1.1.1">

<p>Most basic invocation of <b>GET</b> is only with <b>url</b> you want to get.
Extended invocation includes options that can be any options
accepted by <b>prepare-request</b> (:headers :query ..).
</p>
<p>
Simple invocation:
</p>
<p class="verse">
(let [resp (GET "&lt;your url&gt;")<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; status (:status @resp)<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; headers (:headers @resp)<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; body (:body @resp)]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; (println (:code status))<br/>
&nbsp;&nbsp;&nbsp;&nbsp; (println (apply str (map char body))))<br/>
</p>


<p>
Invocation with query parameters:
</p>
<p class="verse">
(let [resp (GET "&lt;your url&gt;" {:query {:param-name "some-value}})<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; status (:status @resp)<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; headers (:headers @resp)<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; body (:body @resp)]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; (println (:code status))<br/>
&nbsp;&nbsp;&nbsp;&nbsp; (println (apply str (map char body))))<br/>
</p>

</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> POST/PUT </h4>
<div class="outline-text-4" id="text-1.1.2">

<p><b>PUT*/*POST</b> work the same way as get but they accept <b>body</b> as
parameter as well.
</p>
<p>
<b>body</b> can be:
</p><ul>
<li>
String
</li>
<li>
map, for easy form data submissions
</li>
<li>
InputStream for any content
</li>
</ul>

</div>

<div id="outline-container-1.1.2.1" class="outline-5">
<h5 id="sec-1.1.2.1"><span class="section-number-5">1.1.2.1</span> Submitting body as String </h5>
<div class="outline-text-5" id="text-1.1.2.1">

<p>You can send String as body with PUT/POST:
</p>
<p class="verse">
(let [resp (POST "&lt;your url&gt;" "SampleBody")]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>

</div>

<div id="outline-container-1.1.2.2" class="outline-5">
<h5 id="sec-1.1.2.2"><span class="section-number-5">1.1.2.2</span> Submitting form parameters </h5>
<div class="outline-text-5" id="text-1.1.2.2">

<p>For now there are two ways to submit body parameters.
Most likely only one will survive.
</p>
<p>
Submitting parameters via options:
</p>
<p class="verse">
(let [resp (POST "&lt;your url&gt;" nil {:param {:a 5 :b 6}})]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>


<p>
Submitting parameters via body map:
</p>
<p class="verse">
(let [resp (POST "&lt;your url&gt;" {:u "user" :p "s3cr3t"})]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>

</div>

<div id="outline-container-1.1.2.3" class="outline-5">
<h5 id="sec-1.1.2.3"><span class="section-number-5">1.1.2.3</span> Submitting body as InputStream </h5>
<div class="outline-text-5" id="text-1.1.2.3">

<p>Last method to provide body is via InputStream:
</p>
<p class="verse">
(use '[clojure.java.io :only [input-stream]])<br/>
(let [resp (PUT "&lt;your url&gt;" (input-stream (.getBytes "SampleContent" "UTF-8")))]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>
</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> DELETE </h4>
<div class="outline-text-4" id="text-1.1.3">

<p>To call DELETE on a resource:
</p>
<p class="verse">
(let [resp (DELETE "&lt;your url&gt;")]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>

</div>

<div id="outline-container-1.1.4" class="outline-4">
<h4 id="sec-1.1.4"><span class="section-number-4">1.1.4</span> HEAD </h4>
<div class="outline-text-4" id="text-1.1.4">

<p>To call HEAD on a resource:
</p>
<p class="verse">
(let [resp (HEAD "&lt;your url&gt;")]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>

</div>

<div id="outline-container-1.1.5" class="outline-4">
<h4 id="sec-1.1.5"><span class="section-number-4">1.1.5</span> OPTIONS </h4>
<div class="outline-text-4" id="text-1.1.5">

<p>To call OPTIONS on a resource:
</p>
<p class="verse">
(let [resp (OPTIONS "&lt;your url&gt;")]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something with @resp<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> <span class="done DONE"> DONE</span> Requesting &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1.2">

<p>This is lower level access to <b>ahc-clj</b>.
It provides default set of callbacks and functions to create and
execute reqeusts.
</p>
</div>

<div id="outline-container-1.2.1" class="outline-4">
<h4 id="sec-1.2.1"><span class="section-number-4">1.2.1</span> Preparing request </h4>
<div class="outline-text-4" id="text-1.2.1">

<p><b>prepare-request</b> is responsible for request preparation.
It takes following arguments:
</p><ul>
<li>
HTTP Method like <b>:get</b> <b>:head</b>
</li>
<li>
<b>url</b> that you want to call
</li>
<li>
and optional <b>options</b> map:
<ul>
<li>
<b>:query</b> is map of query parameters to be sent over
</li>
<li>
<b>:headers</b> is map of headers to be send over
</li>
<li>
<b>:params</b> is map of request parameters to send over, keep in
mind that those should be send only with <b>PUT</b> and <b>POST</b>
requests.
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2.2" class="outline-4">
<h4 id="sec-1.2.2"><span class="section-number-4">1.2.2</span> Executing request </h4>
<div class="outline-text-4" id="text-1.2.2">

<p><b>execute-request</b> returns a <b>promise</b> that will be <b>delivered</b>
once response is received.
It takes request to be executed (one returned by
<b>prepare-request</b>) and <b>options</b> map.
<b>options</b> map consists of:
</p><ul>
<li>
<b>:status</b> status line received callback
</li>
<li>
<b>:headers</b> headers received callback
</li>
<li>
<b>:part</b> body part received callback
</li>
<li>
<b>:completed</b> body receiving completed callback
</li>
<li>
<b>:error</b> error callback
</li>
</ul>

<p>All callbacks take <b>(ref {})</b> as first argument. This is STM map
per request, you can store here what ever you want. Look at
implementations of default callbacks for more information.
</p>
</div>

<div id="outline-container-1.2.2.1" class="outline-5">
<h5 id="sec-1.2.2.1"><span class="section-number-5">1.2.2.1</span> Status line </h5>
<div class="outline-text-5" id="text-1.2.2.1">

<p>Status line callback is called with <b>state</b> and lazy map with following keys:
</p><ul>
<li>
<b>:code</b> status code
</li>
<li>
<b>:msg</b> status message
</li>
<li>
<b>:protocol</b> protocol with version (HTTP/1.1)
</li>
<li>
<b>:major</b> major protocol version
</li>
<li>
<b>:minor</b> minor protocol version
</li>
</ul>
</div>

</div>

<div id="outline-container-1.2.2.2" class="outline-5">
<h5 id="sec-1.2.2.2"><span class="section-number-5">1.2.2.2</span> Headers </h5>
<div class="outline-text-5" id="text-1.2.2.2">

<p>Headers callback is called with <b>state</b> and lazy map of headers.
Keys in that map are <b>(keyword (.toLowerCase &lt;header name&gt;))</b>, so
"Server" headers is <b>:server</b> and so on.
</p></div>

</div>

<div id="outline-container-1.2.2.3" class="outline-5">
<h5 id="sec-1.2.2.3"><span class="section-number-5">1.2.2.3</span> Body part </h5>
<div class="outline-text-5" id="text-1.2.2.3">

<p>Body part callback is called with <b>state</b> and <b>vec</b> of bytes that
have been received.
</p></div>

</div>

<div id="outline-container-1.2.2.4" class="outline-5">
<h5 id="sec-1.2.2.4"><span class="section-number-5">1.2.2.4</span> Body completed </h5>
<div class="outline-text-5" id="text-1.2.2.4">

<p>This callback is called with <b>state</b> only and result of it is
delivered to response promise.
</p></div>

</div>

<div id="outline-container-1.2.2.5" class="outline-5">
<h5 id="sec-1.2.2.5"><span class="section-number-5">1.2.2.5</span> Error </h5>
<div class="outline-text-5" id="text-1.2.2.5">

<p>Error callback gets called with <b>state</b> and <b>Throwable</b>.
</p></div>
</div>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> <span class="done DONE"> DONE</span> Streaming &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel1">rel1</span></span></h3>
<div class="outline-text-3" id="text-1.3">

<p>Consuming HTTP Stream is quite straight forward with <b>ahc-clj</b>.
You will need to know what HTTP Method you will call, what URL
and provide a call back function to handle body parts been
received.
</p>
<p class="verse">
(let [stream (ref #{})<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; resp (STREAM :get "&lt;your url&gt;"<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (fn [state bytes]<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (if (not (empty? bytes))<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (let [p (apply str (map char bytes))]<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (dosync (alter stream conj p)))<br/>
&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; (println "Empty body part received."))))]<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; do something to @stream<br/>
&nbsp;&nbsp;&nbsp;&nbsp; ; @resp will not get delivered until streaming is done<br/>
&nbsp;&nbsp;&nbsp;&nbsp; )<br/>
</p>

<p>Few notes on implementing body part callback:
</p><ul>
<li>
state is <b>(ref {})</b> with <b>:status</b> and <b>:headers</b>,
</li>
<li>
some streams are not meant to be finish, in that case don't
collect body parts, as for sure you will run out of available
resources,
</li>
<li>
try not to do any heavy lifting in this callback, better send it
to agent,
</li>
<li>
if you need to stop stream consumption just return <b>:abort</b> from
callback.
</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Developer [0/1] </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2.1" class="outline-3">
<h3 id="sec-2.1"><span class="section-number-3">2.1</span> <span class="todo TODO"> TODO</span> Building &nbsp;&nbsp;&nbsp;<span class="tag"><span class="rel2">rel2</span></span></h3>
<div class="outline-text-3" id="text-2.1">

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Hubert Iwaniuk
<a href="mailto:neotyk@kungfoo.pl">&lt;neotyk@kungfoo.pl&gt;</a>
</p>
<p class="date"> Date: 2010-07-14 15:45:59 CEST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
